1. Create a new column in the DataFrame and name it Total Sales. This column is a sum of Consulting Sales and Software Sales. Use head or tail to peek at the resulting data frame to confirm that the output matches your expectation. What is the sum of the Total Sales column?

In [95]:
import pandas as pd

dfCompa = pd.read_csv("data_input/companies.csv", index_col=0)
#dfCompa.head()
#dfCompa.dtypes

dfCompa["Total Sales"] = dfCompa["Consulting Sales"] + dfCompa["Software Sales"]
itotal_sales = dfCompa["Total Sales"].sum()

print(total_sales)

19238903

2. Which company has the biggest Total Sales in 2017?

In [114]:
dfCompa[(dfCompa['Total Sales'] == (dfCompa[dfCompa["Year"] == 2017]["Total Sales"].max()))].head()

         Customer Name  Consulting Sales  ...     Account Total Sales
ID                                        ...
30940  New Media Group           7125000  ...  Enterprise    12625000

[1 rows x 11 columns]

3. Which are the two companies that has sales exceeding 1,500,000 IDR in the sampled data frame?

In [116]:
dfCompa[(dfCompa['Total Sales'] > 1500000)]

               Customer Name  Consulting Sales  ...     Account Total Sales
ID                                              ...
30940        New Media Group           7125000  ...  Enterprise    12625000
19002  Palembang Konsultansi           2115000  ...     Startup     2115000

[2 rows x 11 columns]

4. The simplest way to ignore the outliers of sample data and find its central value is by using median instead of mean. By ignoring the outliers of Total Sales, what is its central value?

In [118]:
dfCompa['Total Sales'].median()

1354250.0

5. If we want to perform subsetting on clients by explicitly stating the ID, which subsetting method is more appropriate?

In [122]:
dfCompa.loc[19002,:]

Customer Name        Palembang Konsultansi
Consulting Sales                   2115000
Software Sales                           0
Forecasted Growth                  -15.00%
Returns                                  0
Month                                    2
Day                                     24
Year                                  2018
Location                           Bandung
Account                            Startup
Total Sales                        2115000
Name: 19002, dtype: object

6. Say, we need to find clients of Enterprise account which specifically located in Jakarta. Try to fill in the blank codes to perform the right conditional subsetting: clients[________ _ ________]:

In [125]:
dfCompa[(dfCompa['Location']=='Jakarta') & (dfCompa['Account']=='Enterprise')]

                   Customer Name  Consulting Sales  ...     Account Total Sales
ID                                                  ...
30940            New Media Group           7125000  ...  Enterprise    12625000
31142  PT. Surya Citra Manajemen            960000  ...  Enterprise     1463000

[2 rows x 11 columns]